src/Documents/Покупка/Покупка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Покупка</name>
  <registerRecords>AccumulationRegister.СостояниеПогреба</registerRecords>
  <attributes>
    <name>Погреб</name>
    <type>
      <types>CatalogRef.Погреба</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вина</name>
    <attributes>
      <name>Вино</name>
      <type>
        <types>CatalogRef.Вина</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/СостояниеПогреба/СостояниеПогреба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СостояниеПогреба</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Погреб</name>
    <type>
      <types>CatalogRef.Погреба</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вино</name>
    <type>
      <types>CatalogRef.Вина</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Покупка/ObjectModule.bsl
// Генерация движений по документу
// 
// Параметры:
// 	Отказ - Булево - прерывание процесса проведения
// 	РежимПроведения - DocumentPostingMode - режим проведения документа (Оперативный, неоперативный)
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НЗ = Движения.СостояниеПогреба;
	НЗ.Записывать = Истина;
	Для каждого Вино Из Вина Цикл
		З = НЗ.Добавить();
		З.Период = Дата;
		З.ВидДвижения = ВидДвиженияНакопления.Приход;
		З.Вино = Вино.Вино;
		З.Погреб = Погреб;
		З.Количество = Вино.Количество;
		З.Цена = Вино.Цена;
	КонецЦикла;
КонецПроцедуры
